levkropp/cyd-emulator/test-firmware/20-benchmark/sdkconfig.defaults
# Minimal config for benchmark firmware
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
# Reduce binary size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# Disable unnecessary features
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
